import s from "./traditions.module.css";
// import garden from "./garden.mp4";
import garden from "./deskkkk.mp4";

const Traditions = () => {
  return (
    <section className={s.wrapper}>
      <div className={s.container}>
        <h3 className={s.headerText}>
          Символ традицій для українців та її шанувальників
        </h3>

        <div className={s.descWrapper}>
          <p className={s.description}>
            Рослини Червоної книги України — це цінні види, які перебувають під
            загрозою зникнення та потребують негайного захисту. Вони є
            унікальними представниками нашої природи і відіграють важливу роль у
            збереженні біологічного різноманіття. Червона книга містить рослини,
            які не тільки прикрашають наші ліси, степи та луки, але й
            забезпечують природний баланс у екосистемах. Важливо усвідомлювати
            значення кожного з видів, адже багато з них знаходяться під загрозою
            через знищення природних місць існування, зміну клімату та людську
            діяльність. Дізнайтеся більше про ці видатні рослини, їхній
            унікальний життєвий цикл та їхню важливість для майбутніх поколінь.
            Червона книга України є нагадуванням про необхідність берегти
            природу та її неповторні створіння.
          </p>
        </div>
        <div className={s.gif}>
          <video width="100%" preload="auto" muted autoPlay loop>
            <source src={garden} type="video/mp4" />
            Ваш браузер не підтримує відео.
          </video>
        </div>
      </div>
    </section>
  );
};

export default Traditions;
