import s from "./protect.module.css";

const Protect = () => {
  return (
    <section className={s.wrapper}>
      <div className={s.container}>
        <p className={s.text}>
          Догляд за рослинами включає регулярний полив, забезпечення достатнього
          освітлення, підживлення добривами та захист від шкідників. Важливо
          також регулярно перевіряти стан ґрунту та пересаджувати рослини при
          необхідності.
        </p>
        <p className={s.text}>
          Рослини потребують різного рівня освітлення, тому важливо розміщувати
          їх у відповідних місцях. Деякі рослини люблять пряме сонячне світло,
          тоді як інші краще ростуть у тіні. Регулярно обертайте горщики, щоб
          рослини росли рівномірно.
        </p>
        <p className={s.text}>
          Поливати рослини слід відповідно до їх потреб. Перевіряйте вологість
          ґрунту перед поливом, щоб уникнути перезволоження або пересихання.
          Використовуйте добрива для забезпечення рослин необхідними поживними
          речовинами.
        </p>
        <p className={s.text}>
          Обрізка рослин допомагає підтримувати їх здоров'я та форму. Видаляйте
          сухі або пошкоджені листя та гілки, щоб стимулювати новий ріст. Деякі
          рослини потребують спеціальної обрізки для цвітіння.
        </p>
        <p className={s.text}>
          Пересадка рослин необхідна для забезпечення їх росту. Використовуйте
          якісний ґрунт та горщики відповідного розміру. Пересаджуйте рослини
          навесні або восени, коли вони знаходяться у стані спокою.
        </p>
        <p className={s.text}>
          Захист від шкідників є важливою частиною догляду за рослинами.
          Регулярно перевіряйте рослини на наявність комах та інших шкідників.
          Використовуйте природні або хімічні засоби для боротьби з ними.
        </p>
        <p className={s.text}>
          Дотримання цих простих правил допоможе вам виростити здорові та
          красиві рослини, які будуть радувати вас своїм виглядом та ароматом.
        </p>
      </div>
    </section>
  );
};

export default Protect;
